IDEA Open Model
SubStructureGeometry.ConnectionPoints Property
Compatible with IDEA StatiCa 20.1
 Array of connection points
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public List<ReferenceElement> ConnectionPoints { get; set; }
Public Property ConnectionPoints As List(Of ReferenceElement)
	Get
	Set
Return Value
Type: List<ReferenceElement>
List of ConnectionPoints
See Also
Reference
SubStructureGeometry Class
IdeaRS.OpenModel.Model Namespace